from scrapy import Spider
from scrapy.selector import Selector
import re

from buildings.items import BuildingsItem


class BuildingsSpider(Spider):
    name = "buildings"
    allowed_domains = ["tau.ac.il"]
    start_urls = [
        "https://www.tau.ac.il/tau/index/units",
    ]

    def parse(self, response):

        LIB_SOCIAL = (32.111707, 34.802064)
        LIB_LAW = (32.111756, 34.803696)
        LIB_WINER = (32.114794, 34.804198)
        LIB_CENTRAL = (32.114294,34.8043761)
        LIB_SCIENCE_HANDASA = (32.114294,34.8043761)
        LIB_LIFE_MEDICIN = (32.114294,34.8043761)

        GILMAN = (32.1127587,34.8044944)
        RECANATI = (32.1128867,34.803507699)
        KAPLON = (32.1124686,34.8063906)
        BUCHMAN_LAW = (32.111771,34.8037145)
        SACKLER = (32.116673,34.8056721)
        WOLFSON = (32.109941,34.8061093)
        SOCIAL_WORK = (32.108851,34.8045899)
        WEB = (32.1152115,34.8054603)
        SHERMAN = (32.1151446,34.80606833)
        BRITANNIA = (32.114473,34.8060826)
        MEXICO_ART = (32.1142583,34.8033967)
        MITSHEL = (32.1143171,34.8020844)
        NAFTALI = (32.1112215,34.802496)
        TATOROVICH_LAW = (32.1116154,34.803808)
        ORENSTEIN = (32.1115591,34.8061842)
        PHYSICS_SHENKAR = (32.1122725,34.8062083)
        SHARET = (32.1123622,34.8035795)
        ROSENBERG = (32.1147261,34.80539569)
        PORTER = (32.1109409,34.8080681)
        SOFTWARE_ENGINEERIN = (32.1088601,34.8057497)
        BERGLAS_ECONOMIC = (32.1095408,34.8044208)
        HEALTH_PROFESSIONS = (32.1164215,34.80483509)
        SCHRIBER = (32.113393, 34.806671)
        CHIMESTY = (32.1120322, 34.8061203)
        MUSIC = (32.112529, 34.802351)
        DAN_DAVID = (32.111321, 34.805617)
        AUDITORIUM_LEV = (32.1120355, 34.8061215)
        AUDITORIUM_PAST = (32.1142933, 34.8034772)
        SMOLRASH_HALL = (32.1103732, 34.8041178)
        DOLFI_HALL = (32.1103732, 34.8041178)

        CYMBALISTA = (32.112582, 34.805218)
        SPORT = (32.116161, 34.802234)
        BEIT_HATFUTZOT = (32.11383, 34.8052562)

        PARKING_SOCIAL_SCIENCE = (32.11051, 34.80266)
        PARKING_SMOLRASH = (32.109625, 34.803786)
        PARKING_MITSHEL = (32.114131,34.801791)
        PARKING_SPORT_CENTER = (32.115653, 34.801879)
        PARKING_TEETH1 =(32.117502, 34.803828)
        PARKING_TEETH2 =(32.117452, 34.804971)
        PARKING_GREEN_HOUSE =(32.107938, 34.803287)
        PARKING_HANDASA_SOCIAL =(32.108663, 34.806135)
        PARKING_BROSHIM =(32.106472, 34.801254)
        PARKING_GORGE_SOCIAL =(32.108065, 34.804628)
        PARKING_MARSHEM =(32.117679, 34.806962)

        GATE1 = (32.115914, 34.80723)
        GATE2 = (32.113731, 34.807407)
        GATE4 = (32.110764, 34.804156)
        GATE5 = (32.110794, 34.803003)
        GATE7 = (32.113209, 34.80215)
        GATE8 = (32.114665, 34.80208)
        GATE9 = (32.11658, 34.801474)
        GATE10 = (32.11665, 34.803993)
        GATE14 = (32.110546, 34.807037)
        GATE16 = (32.109576, 34.803843)
        GATE17 = (32.108531, 34.804787)

        PILPELET_COFFE_SOCIAL = (32.108952, 34.804535)
        PILPELET_COFFE_MAXICO = (32.114202, 34.803574)
        SHESEK_SCIENCE = (32.1122362, 34.8061356)
        SHESEK_NAFTALI = (32.1112215, 34.802496)
        ELIT_GILMAN = (32.1118853, 34.8045422)
        DAILY_MEDICINE = (32.1166707, 34.8055458)
        TZIPORA_WEB = (32.1166707, 34.8054278)
        MERCAZ_HASADA = (32.1122884, 34.803613)
        ECO = (32.1122884, 34.803413)
        FABIANO = (32.1122884, 34.803212)
        KAKAO_LAW = (32.1119317, 34.8037755)
        AROMA = (32.1138094, 34.8050818)
        YOTO_WOLFSON = (32.1103761, 34.8060367)
        HAHUG_HATZFONI = (32.1137377, 34.8020441)
        JAPANIKA = (32.1136203, 34.8017153)

        AMON_CAFE_ADUC = (34.8033,32.1123)
        AMON_CAFE_WEB = (34.80524,32.11512)
        AMON_CAFE_MANAGEMENT = (34.80364,32.11286)
        AMON_CAFE_MATH= (34.80623,32.11339)
        AMON_CAFE_ART= (34.8032,32.11424)
        AMON_SOCIAL_LIB = (34.802,32.11169)
        AMON_SOCIAL = ( 34.80216,32.11124)
        AMON_LAW = ( 34.8038,32.11164)
        AMON_HANDASA= ( 34.80536,32.10922)
        AMON_BRIUT= ( 34.80484,32.11634)
        AMON_ADRICALUT= ( 34.80224,32.11436)
        AMON_MEDICIAIN_LIB= ( 34.80533,32.11609)

        DORMS_BROSHIM = (32.1076281, 34.8026757)
        DORMS_EINSHTEIN = (32.1130427, 34.8011497)
        DORMS_BRUDETZKI = (32.1079172, 34.7983807)
        DORMS_MILMAN = (32.1172151, 34.7966625)

        ALL = [(LIB_SOCIAL,"הספרייה למדעי החברה ולניהול","טלפון 03-63366666\nשעות פעילות:\n" +"   ימים א-ה 8:30-20:00\n" +"   שישי 8:30-12:45 "),
        (LIB_CENTRAL,"הספרייה המרכזית סוראסקי","טלפון 03-63366666\nשעות פעילות:\n" +"   ימים א-ה 8:30-20:00\n" +"   שישי 8:30-12:45 "),
        (LIB_SCIENCE_HANDASA,"ההספרייה למדעים מדויקים והנדסה","טלפון 03-63366666\nשעות פעילות:\n" +"   ימים א-ה 8:30-20:00\n" +"   שישי 8:30-12:45 "),
        (LIB_LAW,"הספריה למשפטים","טלפון 03-63366666\nשעות פעילות:\n" +"   ימים א-ה 8:30-20:00\n" +"   שישי 8:30-12:45 "),
        (LIB_LIFE_MEDICIN,"הספריה למדעי החיים ולרפואה","טלפון 03-63366666\nשעות פעילות:\n" +"   ימים א-ה 8:30-20:00\n" +"   שישי 8:30-12:45 "),
        (LIB_WINER,"ספריית וינר","טלפון 03-63366666\nשעות פעילות:\n" +"   ימים א-ה 8:30-20:00\n" +"   שישי 8:30-12:45 "),
        (SCHRIBER,"בניין שרייבר- ביה\"ס למדעי המתמטיקה"," שעות פתיחה מעבדת מחשבים: \n   ימים א-ה 24 שעות\n   שישי 17:00-00:00"),
        (CHIMESTY,"בניין שנקר כימיה","מזכירות בית הספר: 03-6408751"),
        (MUSIC,"ביה\"ס למוסיקה בוכמן מהטה","טלפון מזכירות תלמידים: 03-6408415\nשעות קבלה:\n   ימים א, ב, ה 9:00-15:00 \n   יום ד 12:00-16:00 "),
        (BERGLAS_ECONOMIC,"ביה\"ס לכלכלה ברגלס"," "), 
        (BRITANNIA,"בניין בריטניה מדעי החיים"," "), 
        (GILMAN,"בניין גילמן-הפקולטה למדעי הרוח ע\"ש לסטר וסאלי אנטין"," "), 
        (RECANATI,"בניין רקאנטי - הפקולטה לניהול ע\"ש קולר"," "), 
        (KAPLON,"בניין קפלון - פיזיקה"," "), 
        (BUCHMAN_LAW,"בניין בוכמן- משפטים"," "), 
        (SACKLER,"הפקולטה לרפואה ע\"ש סאקלר"," "), 
        (WOLFSON,"בניין וולפסון - הנדסה"," "), 
        (SOCIAL_WORK,"בית הספר לעבודה סויציאלית"," "), 
        (WEB,"בניין ווב שפות"," "), 
        (SHERMAN,"בניין שרמן - מדעי החיים"," "), 
        (MEXICO_ART,"בניין מכסיקו - הפקולטה לאומנויות"," "), 
        (MITSHEL,"בניין מיטשל - אגודת הסטודנטים"," "), 
        (NAFTALI,"בניין נפתלי - מדעי החברה"," "), 
        (TATOROVICH_LAW,"בניין בוכמן- משפטים"," "), 
        (ORENSTEIN,"בניין אורנשטיין - כימיה"," "),
        (PHYSICS_SHENKAR,"בניין פיזיקה - שנקר"," "), 
        (SHARET,"בניין שרת - חינוך"," "), 
        (ROSENBERG,"בניין רוזנברג - מדעי היהדות"," "), 
        (PORTER,"ביה\"ס ללימודי הסביבה פורטר"," "), 
        (SOFTWARE_ENGINEERIN,"בניין הנדסת תוכנה"," "), 
        (BERGLAS_ECONOMIC,"ביה\"ס לכלכלה ברגלס"," "), 
        (HEALTH_PROFESSIONS,"מקצועות הבריאות"," "), 
        (DAN_DAVID,"בניין כיתות לימוד"," "), 
        (AUDITORIUM_LEV,"אודיטוריום לב"," "), 
        (AUDITORIUM_PAST,"אודיטוריום פאסטליכט"," "), 
        (SMOLRASH_HALL,"אולם סמולרש"," "), 
        (DOLFI_HALL,"אולם דולפי אבנר"," "), 
        (CYMBALISTA,"טלפון 03-6408020\nשעות פתיחה: 8:00-15:00","מרכז למורשת יהדות צימבליסטה"),
        (BEIT_HATFUTZOT,"מוזיאון העם היהודי\n"+"ראשון – רביעי:10:00-19:00\n" +"חמישי:10:00-22:30\n" +"שישי:9:00-14:00\n" +"שבת:10:00-15:00","בית התפוצות"),
        (PILPELET_COFFE_SOCIAL,"קפה פלפלת עבודה סוציאלית","שעות פתיחה 9:00-18:00"),
        (PILPELET_COFFE_MAXICO,"קפה פלפלת מקסיקו"),"שעות פתיחה 9:00-18:00"),
        (SHESEK_SCIENCE,"קפיטריית ש.ס.ק מדעים מדוייקים","שעות פתיחה 9:00-18:00"),
        (SHESEK_NAFTALI,"קפיטריית ש.ס.ק מדעי החברה","שעות פתיחה 9:00-18:00"),
        (ELIT_GILMAN,"קפה עלית גילמן","שעות פתיחה 9:00-18:00"),
        (DAILY_MEDICINE,"קפיטריית דיילי - רפואה","שעות פתיחה 9:00-18:00"),
        (YOTO_WOLFSON,"קפיטריית יוטו - בניין וולפסון","שעות פתיחה 9:00-18:00"),
        (TZIPORA_WEB,"קפיטריית ציפורה - ווב שפות","שעות פתיחה 9:00-18:00"),
        (MERCAZ_HASADA,"מרכז הסעדה","שעות פתיחה 9:00-18:00"),
        (ECO,"קפיטריית אקו","שעות פתיחה 9:00-18:00"),
        (FABIANO,"קפיטריית פביאנו","שעות פתיחה 9:00-18:00"),
        (KAKAO_LAW,"קפיטריית קקאו - משפטים","שעות פתיחה 9:00-18:00"),
        (AROMA,"ארומה בית התפוצות","שעות פתיחה: א-ה 7:00-19:00 ו 7:00-14:00"),
        (HAHUG_HATZFONI,"החוג הצפוני","פאב-מסעדה \n"+"טלפון: 03-6544870\n" +"שעות פעילות:" +"א'-שבת: 09:00-04:0"),
        (JAPANIKA,"ג'פניקה","שעות פתיחה:\n" +"ראשון עד רביעי: 11:30-00:00\n" +"חמישי עד שבת: 12:00-01:00 "),
        (SPORT,"מרכז הספורט עלית","טלפון: 8909* \nשעות פעילות:\n   ימים א-ה 5:30-24:00\n   שישי 5:30-20:00\n   שבת 6:45-20:00"),
        (PARKING_SOCIAL_SCIENCE,"חניון מדעי החברה","שעות פעילות: 24/7"),
        (PARKING_MITSHEL,"חניון מיטשל - מרכז הסטודנטים"," "),
        (PARKING_TEETH1,"חניון רפואת שיניים 1"," "),
        (PARKING_TEETH2,"חניון רפואת שיניים 2"," "),
        (PARKING_BROSHIM,"חניון ברושים- הנדסאים"," "),
        (PARKING_GREEN_HOUSE,"חניון הבית הירוק"," "),
        (PARKING_GORGE_SOCIAL,"חניון ג'ורג' וויז מערב/מזרח"," "),
        (PARKING_HANDASA_SOCIAL,"חניון הנדסה"," "),
        (PARKING_MARSHEM,"חניון מרשם"," "),
        (PARKING_SMOLRASH,"חניון סמולרש"," "),
        (PARKING_SPORT_CENTER,"חניון מרכז הספורט"," "),
        (GATE1,"שער 1 (אוסטריה)","ימי א'-ה': 07:30-19:30\n" +"\n" +"ימי שישי-ערב חג: 07:30-14:30\n" +"\n" +"ימי שבת/חג: סגור"),
        (GATE2,"שער 2 (מתתיה)","ימי א'-ה': 06:30-19:30\n" +"ימי שישי-ערב חג: 07:30-14:30\n" +"ימי שבת/חג: סגור "),
        (GATE4,"שער 4 (רומינסיאנו)","פתוח ברציפות 24 שעות ביממה"),
        (GATE5,"שער 5 (יוסף קריס)","שעות פתיחה:\n   ימים א-ה 7:30-12:30 \n    שישי סגור\n שבת/חג:סגור"),
        (GATE7,"שער 7 (פרנקל)","ימי א'-ה': 07:30-19:30\n" +"ימי שישי-ערב חג: 07:30-12:00\n" +"ימי שבת/חג: סגור"),
        (GATE8,"שער 8 (דן בוכנר)","ימי א'-ה': 06:30-22:00\n" +"ימי שישי-ערב חג: 07:30-13:00\n" +"ימי שבת/חג: סגור "),
        (GATE9,"שער 9 (יוסף פאפר)",""),
        (GATE10,"שער 10 (רפואת שיניים)","ימי א'-ה': 07:00-21:00\n" +"ימי שישי-ערב חג:07:00-15:00\n" +"ימי שבת/חג: סגור "),
        (GATE14,"שער 14 (לימודי חוץ)","ימי א'-ה': 06:00-18:00\n" +"ימי שישי-ערב חג: סגור \n" +"ימי שבת/חג: סגור"),
        (GATE16,"שער 16 (עבודה סוציאלית)","ימי א'-ה': 07:30-18:30\n" +"ימי שישי-ערב חג: סגור\n" +"ימי שבת/חג: סגור"),
        (GATE17,"שער 17 (כיתות חשמל)","ימי א'-ה': 07:30-18:00\n" +"ימי שישי-ערב חג: 7:30-12:00\n" +"ימי שבת/חג: סגור"),
        (DORMS_BROSHIM,"מעונות ברושים","טל: 03-6408333 פקס: 03-6413671 \n"+"דוא\"ל: office@meonot-shik.co.il / Efrat_m@shikunbinui.com"),
        (DORMS_BRUDETZKI,"מעונות ברודצקי","ליצירת קשר טלפוני: 077-3307011/4/5 \n" +"משרד המעונות רח´ טאגור 32 רמת אביב, ת\"א\n" +"פקס: 03-6425262\n" +"info@dorms-tau.co.il"),
        (DORMS_EINSHTEIN,"מעונות איינשטיין","טל: 03-6408333 פקס: 03-6413671 \n"+"\nדוא\"ל: office@meonot-shik.co.il / Efrat_m@shikunbinui.com"+"משרדי המעונות ממוקמים בבניין E ופתוחים בימים א'-ה' בין השעות 16:00 - 8:00"),
        (DORMS_MILMAN,"מעונות מילמן","כתובת המזכירות: בית מילמן, רחוב טאגור 32, רמת אביב\n" +"שעות קבלה - א’-ה’ 9:00-17:00\n" +"טלפון: 077-3307011/4/5  פקס: 03-6425262\n" +"מייל: info@dorms-tau.co.il")]
                
        for something in ALL:
            print(something)

    
